import { defineEventHandler } from "h3";

export default defineEventHandler(async() => {
	const mock = {
		workspaces: {
			Москва: {
				Цех1: ["Иванов", "Петров", "Сидоров"],
				Цех2: ["Андреев", "Лебедев"],
				Цех3: ["Смирнов", "Кузнецов"],
				Цех4: ["Григорьев", "Михайлов"],
			},
			СПб: {
				Цех1: ["Кузнецов", "Горбунов"],
				Цех2: ["Смирнов", "Петров"],
				Цех3: ["Федоров"],
				Цех4: ["Чернов", "Калинин"],
				Цех5: ["Денисов", "Логинов"],
			},
			Казань: {
				Цех1: ["Сергеева", "Васильева"],
				Цех2: ["Егорова", "Алексеев"],
				Цех3: ["Бондарев", "Соколова"],
			},
			Екатеринбург: {
				Цех1: ["Николаев", "Кузьмичев"],
				Цех2: ["Крылов", "Рогов"],
			},
			Новосибирск: {
				Цех1: ["Тимофеев", "Мельников"],
				Цех2: ["Максимов", "Панин"],
			},
		},
		teams: ["Бригада1", "Бригада2"],
		shifts: ["Смена1", "Смена2"],
	};

	return mock;
});
